# **Practice Lab: Selecting Data in a DataFrame**

## Objectives

After completing the lab I will be able to:

* Use Pandas Library to create DataFrames and Series
* Locate data in the DataFrame using `loc()` and `iloc()` functions
* Use slicing

### Exercise 1: Pandas - DataFrames and Series

**Pandas** is a popular library for data anlysis built on top of the Python programming language. Pandas generally provide two data structures for manipulating data, they are:
* DataFrame
* Series

A **DataFrame** is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns
* A Pandas DataFrame will be created by loading the datasets from existing storage
* Storage can be a SQL database, CSV file, Excel file, etc.
* It can also be generated from the lists, dictionaries, and from a list of dictionaries

**Series** represents a one-dimensional array of indexed data. It has two main components:
* An array of actual data
* An associated array of indexes or data labels

The index is used to access individual data vlaues. You can also get a column of a DataFrame aas a **Series**. You can think of a Pandas series as a 1-D DataFrame

In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.1.3-cp312-cp312-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\matth\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\matth\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ----- ---------------------------------- 1.6/11.5 MB 9.4 MB/s eta 0:00:02
   ------------ --------------------------- 3.7/11.5 MB 9.9 MB/s eta 0:00:01
   -------------------- ------------------- 6.0/11.5 MB 10.5 MB/s eta 0:00:01
   ----------------------------- ---------- 8.4/11.5 MB 10.6 MB/s eta 0:00:01
   ------------------------------------- -- 10.7/11.5 MB 11.0 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 10.7 MB/s eta 0:00:00
Downloading numpy-2.1.3-cp312-cp312-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   ------ --------------------------------- 2.1/12.6 MB 11.8 MB/s eta 0:00:01
   --------------- ------------------------ 4.7/12.6 MB 11.9 MB/s eta 0:00:01
   --------------------- ------------------ 6.8/12.6 MB 11.7 MB/s eta 0:00:01
   ----------------------------- ---------- 9.2/12.6 MB 11.4 MB/s eta 0:00:01
   ----------------------------------- ---- 11.3/12.6 MB 11.0 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 10.8 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.1.3 pandas-2.2.3 pytz-2024.2 tzdata-2024.2

In [2]:
# Now we import the Pandas library

import pandas as pd

Once we have imported pandas, we can then use the built-in functions to create and analyze data

**In this lab, we will learn how to create a DataFrame out of a dictionary**

Let us consider a dictionary 'x' with keys and values as shown below

We then create a DataFrame from the dictionary using the function `pd.DataFrame(dict)`

In [3]:
# Define our dictionary 'x'

x = {'Name' : ['Rose', 'John', 'Jane', 'Mary'], 'ID' : [1, 2, 3, 4], 'Department' : ['Architecture Group', 'Software Group', 'Design Team', 'Infrastructure'], 
     'Salary' : [100000, 80000, 50000, 60000]}

# Casting the ditionary to a DataFrame:
df = pd.DataFrame(x)

#Display the result of 'df'
df

   Name  ID          Department  Salary
0  Rose   1  Architecture Group  100000
1  John   2      Software Group   80000
2  Jane   3         Design Team   50000
3  Mary   4      Infrastructure   60000

We can see the direct correspondance between the table. The keys correspond to the column labels and the values or lists correspond to the rows.

## Column Selection:

To select a column in Pandas DataFrame, we can access the columns by calling them by their column name

Let's retrieve the data present in the `ID` column:

In [4]:
# Retrieve the 'ID' column and assign it to the variable 'x'

x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

Let's use the `type()` function and check the type of variable

In [5]:
# Check the 'type' of 'x'

type(x)

pandas.core.frame.DataFrame

The output shows us that the type of the variable is a DataFrame object

## Access to Multiple Columns

Let's retrieve the data for `Department`, `Salary`, and `ID` columns:

In [6]:
# Retrieve the 'Department'. 'Salary', and 'ID' columns and assign to variable 'z'

z = df[['Department', 'Salary', 'ID']]
z

           Department  Salary  ID
0  Architecture Group  100000   1
1      Software Group   80000   2
2         Design Team   50000   3
3      Infrastructure   60000   4

## Try it Yourself

Problem 1: Creata a DataFrame to display the results below

<center>
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/images/Student_data.png" width="300" alt="Student Data">
</center>

In [10]:
# Define our dictionary to hold data shown above ('Student', 'Age', 'Country', 'Course', 'Marks')

StudentsDict = {"Student" : ["David", "Samuel", "Terry", "Evan"], "Age" : [27, 24, 22, 32], "Country" : ["UK", "Canada", "China", "USA"], 
                "Course" : ["Python", "Data Structures", "Machine Learning", "Web Development"], "Marks" : [85, 72, 89, 76]}

Students_DataFrame = pd.DataFrame(StudentsDict)

Students_DataFrame

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

Problem 2: Retrieve the 'Marks' column and assign it to a variable 'b'

In [12]:
# Assign the column 'Marks' to variable 'b'

b = Students_DataFrame[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

Problem 3: Retrieve the Country and Course columns and assign it to variable 'c'

In [13]:
# Assign 'Country' and 'Course' columns to the variable 'c'

c = Students_DataFrame[['Country', 'Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

#### To view the column as a series, just use one bracket:

In [15]:
# Get the 'Student' column as a series Object

x = Students_DataFrame['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [16]:
# Check the type of 'x'

type(x)

pandas.core.series.Series

The output shows us that the type of the cariable is a series Object

## Exercise 2: `loc()` and `iloc()` functions

`loc()` is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it

Simple syntax for our understanding:
* loc[row_label, column_label]

`iloc()` is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it

Simple syntax for our understanding:
* iloc[row_index, column_index]

#### Let's see some examples on the same:

In [19]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'Rose'

In [18]:
# Access the value on the first row and the third column

df.iloc[0, 2]

'Architecture Group'

In [20]:
# Access the column using the column name

df.loc[0, 'Salary']

np.int64(100000)

Let's create a new DataFrame called 'df2' and assign 'df' to it. Then, let's use the 'Name' column as an index column using the method set_index()

In [21]:
df2 = df

df2 = df2.set_index('Name')

In [22]:
# To display the first 5 rows of the new DataFrame (df2)

df2.head()

      ID          Department  Salary
Name
Rose   1  Architecture Group  100000
John   2      Software Group   80000
Jane   3         Design Team   50000
Mary   4      Infrastructure   60000

In [23]:
# Now, let's access the column using the name

df2.loc['Jane', 'Salary']

np.int64(50000)

### Try it Yourself

Use the `loc()` function to get the department of Jane in the newly created DataFrame, df2

In [24]:
# Use loc() to retrieve Jane's department from df2

df2.loc['Jane', 'Department']

'Design Team'

Use the `iloc()` function to get the salary of Mary in the newly created DataFrame, df2

In [29]:
# Use iloc() to retrieve Mary's salary from df2

df2.iloc[3, 2]

np.int64(60000)

### Exercise 3: Slicing

Slicing uses the [] operator to select a set of rows and/or columns from a DataFrame

To slice out a set of rows, use the syntax: data[start:stop]

Here the start represents the index from where to consider, and stop represents the index one step BEYOND the row you want to select. You can perform slicing using both the index and the name of the column

` ` NOTE: When slicing in Pandas, the start bound is included in the output

So if you want to select rows 0, 1, and 2, your code would look like this: df.iloc[0:3]

It means you are telling Python to start at index 0 and select rows 0, 1, 2 up to, but not including, 3

` ` NOTE: Labels must be found in the DataFrame or you will recieve a KeyError

Indexing by labels (i.e. using `loc()`) differs from indexing by integers (i.e. using `iloc()`. With `loc()`, both the start bound and the stop bound are inclusive. When using `loc()`, integers can be used, but the integers refer to the index label and not the position

For example, using `loc()` and selecting 1:4 will get a different result than using `iloc()` and selecting 1:4

#### We can also slect a specific data value using a row and column location within the DataFram and iloc indexing

In [30]:
# Let's do the slicing using the old DataFrame, df

df.iloc[0:2, 0:3]

   Name  ID          Department
0  Rose   1  Architecture Group
1  John   2      Software Group

In [32]:
# Let's do the slicing using the loc() function on the old DataFrame, df, where index column is having labels as 0, 1, 2

df.loc[0:2, 'ID' : 'Department']

   ID          Department
0   1  Architecture Group
1   2      Software Group
2   3         Design Team

In [33]:
# Let's do the slicing using the loc() function on the new DataFrame, df2, where index column is 'Name' having labels: 'Rose', 'John', and 'Jane'

df2.loc['Rose' : 'Jane', 'ID' : 'Department']

      ID          Department
Name
Rose   1  Architecture Group
John   2      Software Group
Jane   3         Design Team

## Try it Myself

Using the `loc()` function, do slicing on the old DataFrame, df, to retrieve the 'Name', 'ID', and 'Department' of index column having labels as 2, 3

In [34]:
# Retrieve 'Name', 'ID', and 'Department' of index columns with labels 2, 3

df.loc[2 : 3, 'Name' : 'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure